ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
/**
 * \brief Component description for PIC32CX/0525SG12 QMSPI
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_QMSPI_COMPONENT_H_
#define _PIC32CX_0525SG12_QMSPI_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_QMSPI The Quad SPI Master Controller may be used to communicate with various \n        peripheral devices that use a Serial Peripheral Interface, such as EEPROMS, DACs and ADCs.\n        The controller can be configured to support advanced SPI Flash devices with multi-phase access protocols.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR QMSPI */
/* ========================================================================== */

/* -------- QMSPI_MODE : (QMSPI Offset: 0x00) (R/W 32) QMSPI Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t ACTIVATE:1;                /**< bit:      0  This bit is used to activate the QMSPI block.\n     1=Enabled. The block is fully operational\n                 0=Disabled. Clocks are gated to conserve power and the output signals are set to their inactive state. */
    uint32_t SOFT_RESET:1;              /**< bit:      1  Writing this bit with a 1 will reset the Quad SPI block. It is self-clearing. */
    uint32_t :6;                        /**< bit:   2..7  Reserved                                      */
    uint32_t CPOL:1;                    /**< bit:      8  Polarity of the SPI clock line when there are no transactions in process. 1=SPI Clock starts High; 0=SPI Clock starts Low. */
    uint32_t CHPA_MOSI:1;               /**< bit:      9  Clock phase of the Master data out. Common SPI modes require this field to be programmed with the same value as CHPA_MISO in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data changes on the falling edge of the SPI clock; 0=Data changes on the rising edge of the SPI clock\n                 If CPOL=0: 1=Data changes on the rising edge of the SPI clock; 0=Data changes on the falling edge of the SPI clock */
    uint32_t CHPA_MISO:1;               /**< bit:     10  Clock phase of the Master data in. Common SPI modes require this field to be programmed with the same value as CHPA_MOSI in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data are captured on the rising edge of the SPI clock; 0=Data are captured on the falling edge of the SPI clock\n                 If CPOL=0: 1=Data are captured on the falling edge of the SPI clock; 0=Data are captured on the rising edge of the SPI clock */
    uint32_t :5;                        /**< bit: 11..15  Reserved                                      */
    uint32_t CLOCK_DIVIDE:9;            /**< bit: 16..24  The SPI clock divide in number of system clocks. A value of 1 divides the master clock by 1, a value of 255 divides the master clock by 255. A value of 0 divides the master clock by 256. */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __QMSPI_MODE_bits_t;
#define QMSPI_MODE_RESETVALUE               (0x0FU)                                       /**<  (QMSPI_MODE) QMSPI Mode Register  Reset Value */

#define QMSPI_MODE_ACTIVATE_Pos               (0)                                            /**< (QMSPI_MODE) This bit is used to activate the QMSPI block.\n     1=Enabled. The block is fully operational\n                 0=Disabled. Clocks are gated to conserve power and the output signals are set to their inactive state. Position */
#define QMSPI_MODE_ACTIVATE_Msk               (0x1U << QMSPI_MODE_ACTIVATE_Pos)              /**< (QMSPI_MODE) This bit is used to activate the QMSPI block.\n     1=Enabled. The block is fully operational\n                 0=Disabled. Clocks are gated to conserve power and the output signals are set to their inactive state. Mask */
#define QMSPI_MODE_SOFT_RESET_Pos             (1)                                            /**< (QMSPI_MODE) Writing this bit with a 1 will reset the Quad SPI block. It is self-clearing. Position */
#define QMSPI_MODE_SOFT_RESET_Msk             (0x1U << QMSPI_MODE_SOFT_RESET_Pos)            /**< (QMSPI_MODE) Writing this bit with a 1 will reset the Quad SPI block. It is self-clearing. Mask */
#define QMSPI_MODE_CPOL_Pos                   (8)                                            /**< (QMSPI_MODE) Polarity of the SPI clock line when there are no transactions in process. 1=SPI Clock starts High; 0=SPI Clock starts Low. Position */
#define QMSPI_MODE_CPOL_Msk                   (0x1U << QMSPI_MODE_CPOL_Pos)                  /**< (QMSPI_MODE) Polarity of the SPI clock line when there are no transactions in process. 1=SPI Clock starts High; 0=SPI Clock starts Low. Mask */
#define QMSPI_MODE_CHPA_MOSI_Pos              (9)                                            /**< (QMSPI_MODE) Clock phase of the Master data out. Common SPI modes require this field to be programmed with the same value as CHPA_MISO in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data changes on the falling edge of the SPI clock; 0=Data changes on the rising edge of the SPI clock\n                 If CPOL=0: 1=Data changes on the rising edge of the SPI clock; 0=Data changes on the falling edge of the SPI clock Position */
#define QMSPI_MODE_CHPA_MOSI_Msk              (0x1U << QMSPI_MODE_CHPA_MOSI_Pos)             /**< (QMSPI_MODE) Clock phase of the Master data out. Common SPI modes require this field to be programmed with the same value as CHPA_MISO in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data changes on the falling edge of the SPI clock; 0=Data changes on the rising edge of the SPI clock\n                 If CPOL=0: 1=Data changes on the rising edge of the SPI clock; 0=Data changes on the falling edge of the SPI clock Mask */
#define QMSPI_MODE_CHPA_MISO_Pos              (10)                                           /**< (QMSPI_MODE) Clock phase of the Master data in. Common SPI modes require this field to be programmed with the same value as CHPA_MOSI in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data are captured on the rising edge of the SPI clock; 0=Data are captured on the falling edge of the SPI clock\n                 If CPOL=0: 1=Data are captured on the falling edge of the SPI clock; 0=Data are captured on the rising edge of the SPI clock Position */
#define QMSPI_MODE_CHPA_MISO_Msk              (0x1U << QMSPI_MODE_CHPA_MISO_Pos)             /**< (QMSPI_MODE) Clock phase of the Master data in. Common SPI modes require this field to be programmed with the same value as CHPA_MOSI in this register.\n     e.g. Mode 0: CPOL=0; CHPA_MISO=0; CHPA_MOSI=0; Mode 3: CPOL=1; CHPA_MISO=1; CHPA_MOSI=1. See datasheet for alternate mode settings.\n                 If CPOL=1: 1=Data are captured on the rising edge of the SPI clock; 0=Data are captured on the falling edge of the SPI clock\n                 If CPOL=0: 1=Data are captured on the falling edge of the SPI clock; 0=Data are captured on the rising edge of the SPI clock Mask */
#define QMSPI_MODE_CLOCK_DIVIDE_Pos           (16)                                           /**< (QMSPI_MODE) The SPI clock divide in number of system clocks. A value of 1 divides the master clock by 1, a value of 255 divides the master clock by 255. A value of 0 divides the master clock by 256. Position */
#define QMSPI_MODE_CLOCK_DIVIDE_Msk           (0x1FFU << QMSPI_MODE_CLOCK_DIVIDE_Pos)        /**< (QMSPI_MODE) The SPI clock divide in number of system clocks. A value of 1 divides the master clock by 1, a value of 255 divides the master clock by 255. A value of 0 divides the master clock by 256. Mask */
#define QMSPI_MODE_CLOCK_DIVIDE(value)        (QMSPI_MODE_CLOCK_DIVIDE_Msk & ((value) << QMSPI_MODE_CLOCK_DIVIDE_Pos))
#define QMSPI_MODE_Msk                        (0x01FF0703UL)                                 /**< (QMSPI_MODE) Register Mask  */

