ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
/* -------- QMSPI_CONTROL : (QMSPI Offset: 0x04) (R/W 32) QMSPI SPI Control -------- */

typedef union
{
  struct
  {
    uint32_t INTERFACE_MODE:2;          /**< bit:   0..1  This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either \n     TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n                  3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. */
    uint32_t TX_TRANSFER_ENABLE:2;      /**< bit:   2..3  This field bit selects the transmit function of the SPI interface.\n                 3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used.\n                 2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n                 1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n                 0=Transmit is Disabled. Not data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. */
    uint32_t TX_DMA_ENABLE:2;           /**< bit:   4..5  This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either\n     the interface reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes.\n     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware */
    uint32_t RX_TRANSFER_ENABLE:1;      /**< bit:      6  This bit enables the receive function of the SPI interface.\n                 1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer\n                 0=Receive is disabled */
    uint32_t RX_DMA_ENABLE:2;           /**< bit:   7..8  This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface\n                 reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n                 1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes\n                 0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware */
    uint32_t CLOSE_TRANSFER_ENABLE:1;   /**< bit:      9  This selects what action is taken at the end of a transfer. When the transaction closes, the Chip Select de-asserts, the SPI \n     interface returns to IDLE and the DMA interface terminates When Description Buffers are in use this bit must be set only on the Last Buffer.\n     1=The transaction is terminated\n     0=The transaction is not terminated */
    uint32_t TRANSFER_UNITS:2;          /**< bit: 10..11  3=TRANSFER_LENGTH defined in units of 16-byte segments\n     2=TRANSFER_LENGTH defined in units of 4-byte segments\n     1=TRANSFER_LENGTH defined in units of bytes\n     0=TRANSFER_LENGTH defined in units of bits. */
    uint32_t DESCRIPTION_BUFFER_POINTER:4;  /**< bit: 12..15  This field selects the first buffer used if Description Buffers are enabled. */
    uint32_t DESCRIPTION_BUFFER_ENABLE:1;  /**< bit:     16  This enables the Description Buffers to be used.\n     1=Description Buffers in use. The first buffer is defined in DESCRIPTION_BUFFER_POINTER\n     0=Description Buffers disabled. */
    uint32_t TRANSFER_LENGTH:15;        /**< bit: 17..31  The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS.\n     A value of 0 means an infinite length transfer. */
  };
  uint32_t w;
} __QMSPI_CONTROL_bits_t;
#define QMSPI_CONTROL_RESETVALUE            (0x200U)                                      /**<  (QMSPI_CONTROL) QMSPI SPI Control  Reset Value */

#define QMSPI_CONTROL_INTERFACE_MODE_Pos      (0)                                            /**< (QMSPI_CONTROL) This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either \n     TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n                  3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. Position */
#define QMSPI_CONTROL_INTERFACE_MODE_Msk      (0x3U << QMSPI_CONTROL_INTERFACE_MODE_Pos)     /**< (QMSPI_CONTROL) This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either \n     TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n                  3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. Mask */
#define QMSPI_CONTROL_INTERFACE_MODE(value)   (QMSPI_CONTROL_INTERFACE_MODE_Msk & ((value) << QMSPI_CONTROL_INTERFACE_MODE_Pos))
#define QMSPI_CONTROL_TX_TRANSFER_ENABLE_Pos  (2)                                            /**< (QMSPI_CONTROL) This field bit selects the transmit function of the SPI interface.\n                 3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used.\n                 2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n                 1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n                 0=Transmit is Disabled. Not data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. Position */
#define QMSPI_CONTROL_TX_TRANSFER_ENABLE_Msk  (0x3U << QMSPI_CONTROL_TX_TRANSFER_ENABLE_Pos)  /**< (QMSPI_CONTROL) This field bit selects the transmit function of the SPI interface.\n                 3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used.\n                 2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n                 1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n                 0=Transmit is Disabled. Not data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. Mask */
#define QMSPI_CONTROL_TX_TRANSFER_ENABLE(value) (QMSPI_CONTROL_TX_TRANSFER_ENABLE_Msk & ((value) << QMSPI_CONTROL_TX_TRANSFER_ENABLE_Pos))
#define QMSPI_CONTROL_TX_DMA_ENABLE_Pos       (4)                                            /**< (QMSPI_CONTROL) This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either\n     the interface reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes.\n     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware Position */
#define QMSPI_CONTROL_TX_DMA_ENABLE_Msk       (0x3U << QMSPI_CONTROL_TX_DMA_ENABLE_Pos)      /**< (QMSPI_CONTROL) This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either\n     the interface reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes.\n     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware Mask */
#define QMSPI_CONTROL_TX_DMA_ENABLE(value)    (QMSPI_CONTROL_TX_DMA_ENABLE_Msk & ((value) << QMSPI_CONTROL_TX_DMA_ENABLE_Pos))
#define QMSPI_CONTROL_RX_TRANSFER_ENABLE_Pos  (6)                                            /**< (QMSPI_CONTROL) This bit enables the receive function of the SPI interface.\n                 1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer\n                 0=Receive is disabled Position */
#define QMSPI_CONTROL_RX_TRANSFER_ENABLE_Msk  (0x1U << QMSPI_CONTROL_RX_TRANSFER_ENABLE_Pos)  /**< (QMSPI_CONTROL) This bit enables the receive function of the SPI interface.\n                 1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer\n                 0=Receive is disabled Mask */
#define QMSPI_CONTROL_RX_DMA_ENABLE_Pos       (7)                                            /**< (QMSPI_CONTROL) This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface\n                 reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n                 1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes\n                 0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware Position */
#define QMSPI_CONTROL_RX_DMA_ENABLE_Msk       (0x3U << QMSPI_CONTROL_RX_DMA_ENABLE_Pos)      /**< (QMSPI_CONTROL) This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface\n                 reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n                 1=DMA is enabled.and set to 1 Byte\n                 2=DMA is enabled and set to 2 Bytes\n                 3=DMA is enabled and set to 4 Bytes\n                 0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware Mask */
#define QMSPI_CONTROL_RX_DMA_ENABLE(value)    (QMSPI_CONTROL_RX_DMA_ENABLE_Msk & ((value) << QMSPI_CONTROL_RX_DMA_ENABLE_Pos))
#define QMSPI_CONTROL_CLOSE_TRANSFER_ENABLE_Pos (9)                                            /**< (QMSPI_CONTROL) This selects what action is taken at the end of a transfer. When the transaction closes, the Chip Select de-asserts, the SPI \n     interface returns to IDLE and the DMA interface terminates When Description Buffers are in use this bit must be set only on the Last Buffer.\n     1=The transaction is terminated\n     0=The transaction is not terminated Position */
#define QMSPI_CONTROL_CLOSE_TRANSFER_ENABLE_Msk (0x1U << QMSPI_CONTROL_CLOSE_TRANSFER_ENABLE_Pos)  /**< (QMSPI_CONTROL) This selects what action is taken at the end of a transfer. When the transaction closes, the Chip Select de-asserts, the SPI \n     interface returns to IDLE and the DMA interface terminates When Description Buffers are in use this bit must be set only on the Last Buffer.\n     1=The transaction is terminated\n     0=The transaction is not terminated Mask */
#define QMSPI_CONTROL_TRANSFER_UNITS_Pos      (10)                                           /**< (QMSPI_CONTROL) 3=TRANSFER_LENGTH defined in units of 16-byte segments\n     2=TRANSFER_LENGTH defined in units of 4-byte segments\n     1=TRANSFER_LENGTH defined in units of bytes\n     0=TRANSFER_LENGTH defined in units of bits. Position */
#define QMSPI_CONTROL_TRANSFER_UNITS_Msk      (0x3U << QMSPI_CONTROL_TRANSFER_UNITS_Pos)     /**< (QMSPI_CONTROL) 3=TRANSFER_LENGTH defined in units of 16-byte segments\n     2=TRANSFER_LENGTH defined in units of 4-byte segments\n     1=TRANSFER_LENGTH defined in units of bytes\n     0=TRANSFER_LENGTH defined in units of bits. Mask */
#define QMSPI_CONTROL_TRANSFER_UNITS(value)   (QMSPI_CONTROL_TRANSFER_UNITS_Msk & ((value) << QMSPI_CONTROL_TRANSFER_UNITS_Pos))
#define QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER_Pos (12)                                           /**< (QMSPI_CONTROL) This field selects the first buffer used if Description Buffers are enabled. Position */
#define QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER_Msk (0xFU << QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER_Pos)  /**< (QMSPI_CONTROL) This field selects the first buffer used if Description Buffers are enabled. Mask */
#define QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER(value) (QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER_Msk & ((value) << QMSPI_CONTROL_DESCRIPTION_BUFFER_POINTER_Pos))
#define QMSPI_CONTROL_DESCRIPTION_BUFFER_ENABLE_Pos (16)                                           /**< (QMSPI_CONTROL) This enables the Description Buffers to be used.\n     1=Description Buffers in use. The first buffer is defined in DESCRIPTION_BUFFER_POINTER\n     0=Description Buffers disabled. Position */
#define QMSPI_CONTROL_DESCRIPTION_BUFFER_ENABLE_Msk (0x1U << QMSPI_CONTROL_DESCRIPTION_BUFFER_ENABLE_Pos)  /**< (QMSPI_CONTROL) This enables the Description Buffers to be used.\n     1=Description Buffers in use. The first buffer is defined in DESCRIPTION_BUFFER_POINTER\n     0=Description Buffers disabled. Mask */
#define QMSPI_CONTROL_TRANSFER_LENGTH_Pos     (17)                                           /**< (QMSPI_CONTROL) The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS.\n     A value of 0 means an infinite length transfer. Position */
#define QMSPI_CONTROL_TRANSFER_LENGTH_Msk     (0x7FFFU << QMSPI_CONTROL_TRANSFER_LENGTH_Pos)  /**< (QMSPI_CONTROL) The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS.\n     A value of 0 means an infinite length transfer. Mask */
#define QMSPI_CONTROL_TRANSFER_LENGTH(value)  (QMSPI_CONTROL_TRANSFER_LENGTH_Msk & ((value) << QMSPI_CONTROL_TRANSFER_LENGTH_Pos))
#define QMSPI_CONTROL_Msk                     (0xFFFFFFFFUL)                                 /**< (QMSPI_CONTROL) Register Mask  */

/* -------- QMSPI_EXECUTE : (QMSPI Offset: 0x08) (R/W 32) QMSPI Execute Register -------- */

typedef union
{
  struct
  {
    uint32_t START:1;                   /**< bit:      0  Writing a 1 to this bit will start the SPI transfer. Writing a 0 to this bit has no effect. This bit is self-clearing.\n     This bit must not be set to 1 if the field STOP in this register is set to 1. */
    uint32_t STOP:1;                    /**< bit:      1  Writing a 1 to this bit will stop any transfer in progress at the next byte boundary. Writing a 0 to this bit has no effect.\n     This bit is self clearing. This bit must not be set to 1 if the field START in this register is set to 1. */
    uint32_t CLEAR_DATA_BUFFER:1;       /**< bit:      2  Writing a 1 to this bit will clear out the Transmit and Receive FIFOs. Any data stored in the FIFOs is discarded and all count fields are reset.\n     Writing a 0 to this bit has no effect. This bit is self clearing. */
    uint32_t :29;                       /**< bit:  3..31  Reserved                                      */
  };
  uint32_t w;
} __QMSPI_EXECUTE_bits_t;
#define QMSPI_EXECUTE_RESETVALUE            (0x01U)                                       /**<  (QMSPI_EXECUTE) QMSPI Execute Register  Reset Value */

#define QMSPI_EXECUTE_START_Pos               (0)                                            /**< (QMSPI_EXECUTE) Writing a 1 to this bit will start the SPI transfer. Writing a 0 to this bit has no effect. This bit is self-clearing.\n     This bit must not be set to 1 if the field STOP in this register is set to 1. Position */
#define QMSPI_EXECUTE_START_Msk               (0x1U << QMSPI_EXECUTE_START_Pos)              /**< (QMSPI_EXECUTE) Writing a 1 to this bit will start the SPI transfer. Writing a 0 to this bit has no effect. This bit is self-clearing.\n     This bit must not be set to 1 if the field STOP in this register is set to 1. Mask */
#define QMSPI_EXECUTE_STOP_Pos                (1)                                            /**< (QMSPI_EXECUTE) Writing a 1 to this bit will stop any transfer in progress at the next byte boundary. Writing a 0 to this bit has no effect.\n     This bit is self clearing. This bit must not be set to 1 if the field START in this register is set to 1. Position */
#define QMSPI_EXECUTE_STOP_Msk                (0x1U << QMSPI_EXECUTE_STOP_Pos)               /**< (QMSPI_EXECUTE) Writing a 1 to this bit will stop any transfer in progress at the next byte boundary. Writing a 0 to this bit has no effect.\n     This bit is self clearing. This bit must not be set to 1 if the field START in this register is set to 1. Mask */
#define QMSPI_EXECUTE_CLEAR_DATA_BUFFER_Pos   (2)                                            /**< (QMSPI_EXECUTE) Writing a 1 to this bit will clear out the Transmit and Receive FIFOs. Any data stored in the FIFOs is discarded and all count fields are reset.\n     Writing a 0 to this bit has no effect. This bit is self clearing. Position */
#define QMSPI_EXECUTE_CLEAR_DATA_BUFFER_Msk   (0x1U << QMSPI_EXECUTE_CLEAR_DATA_BUFFER_Pos)  /**< (QMSPI_EXECUTE) Writing a 1 to this bit will clear out the Transmit and Receive FIFOs. Any data stored in the FIFOs is discarded and all count fields are reset.\n     Writing a 0 to this bit has no effect. This bit is self clearing. Mask */
#define QMSPI_EXECUTE_Msk                     (0x00000007UL)                                 /**< (QMSPI_EXECUTE) Register Mask  */

/* -------- QMSPI_INTERFACE_CONTROL : (QMSPI Offset: 0x0c) (R/W 32) QMSPI Interface Control Register -------- */

typedef union
{
  struct
  {
    uint32_t WRITE_PROTECT_OUT_VALUE:1;  /**< bit:      0  This bit sets the value on the WRITE PROTECT SPI Output Port if it is driven.\n                 1=WRITE PROTECT is driven to 1; 0=WRITE PROTECT is driven to 0 */
    uint32_t WRITE_PROTECT_OUT_ENABLE:1;  /**< bit:      1  1=WRITE PROTECT SPI Output Port is driven\n                 0=WRITE PROTECT SPI Output Port is not driven */
    uint32_t HOLD_OUT_VALUE:1;          /**< bit:      2  This bit sets the value on the HOLD SPI Output Port if it is driven.\n                 1=HOLD is driven to 1; 0=HOLD is driven to 0. */
    uint32_t HOLD_OUT_ENABLE:1;         /**< bit:      3  1=HOLD SPI Output Port is driven\n                 0=HOLD SPI Output Port is not driven. */
    uint32_t PULLDOWN_ON_NOT_SELECTED:1;  /**< bit:      4  1=Enable pull-down resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-down resistors enabled on Receive pins */
    uint32_t PULLUP_ON_NOT_SELECTED:1;  /**< bit:      5  1=Enable pull-up resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-up resistors enabled on Receive pins. */
    uint32_t PULLDOWN_ON_NOT_DRIVEN:1;  /**< bit:      6  1=Enable pull-down resistors on Transmit pins while the pins are not driven\n     0=No pull-down resistors enabled ion Transmit pins. */
    uint32_t PULLUP_ON_NOT_DRIVEN:1;    /**< bit:      7  1=Enable pull-up resistors on Transmit pins while the pins are not driven\n     0=No pull-up resistors enabled ion Transmit pins. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __QMSPI_INTERFACE_CONTROL_bits_t;
#define QMSPI_INTERFACE_CONTROL_RESETVALUE  (0x25U)                                       /**<  (QMSPI_INTERFACE_CONTROL) QMSPI Interface Control Register  Reset Value */

#define QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_VALUE_Pos (0)                                            /**< (QMSPI_INTERFACE_CONTROL) This bit sets the value on the WRITE PROTECT SPI Output Port if it is driven.\n                 1=WRITE PROTECT is driven to 1; 0=WRITE PROTECT is driven to 0 Position */
#define QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_VALUE_Msk (0x1U << QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_VALUE_Pos)  /**< (QMSPI_INTERFACE_CONTROL) This bit sets the value on the WRITE PROTECT SPI Output Port if it is driven.\n                 1=WRITE PROTECT is driven to 1; 0=WRITE PROTECT is driven to 0 Mask */
#define QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_ENABLE_Pos (1)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=WRITE PROTECT SPI Output Port is driven\n                 0=WRITE PROTECT SPI Output Port is not driven Position */
#define QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_ENABLE_Msk (0x1U << QMSPI_INTERFACE_CONTROL_WRITE_PROTECT_OUT_ENABLE_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=WRITE PROTECT SPI Output Port is driven\n                 0=WRITE PROTECT SPI Output Port is not driven Mask */
#define QMSPI_INTERFACE_CONTROL_HOLD_OUT_VALUE_Pos (2)                                            /**< (QMSPI_INTERFACE_CONTROL) This bit sets the value on the HOLD SPI Output Port if it is driven.\n                 1=HOLD is driven to 1; 0=HOLD is driven to 0. Position */
#define QMSPI_INTERFACE_CONTROL_HOLD_OUT_VALUE_Msk (0x1U << QMSPI_INTERFACE_CONTROL_HOLD_OUT_VALUE_Pos)  /**< (QMSPI_INTERFACE_CONTROL) This bit sets the value on the HOLD SPI Output Port if it is driven.\n                 1=HOLD is driven to 1; 0=HOLD is driven to 0. Mask */
#define QMSPI_INTERFACE_CONTROL_HOLD_OUT_ENABLE_Pos (3)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=HOLD SPI Output Port is driven\n                 0=HOLD SPI Output Port is not driven. Position */
#define QMSPI_INTERFACE_CONTROL_HOLD_OUT_ENABLE_Msk (0x1U << QMSPI_INTERFACE_CONTROL_HOLD_OUT_ENABLE_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=HOLD SPI Output Port is driven\n                 0=HOLD SPI Output Port is not driven. Mask */
#define QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_SELECTED_Pos (4)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-down resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-down resistors enabled on Receive pins Position */
#define QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_SELECTED_Msk (0x1U << QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_SELECTED_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-down resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-down resistors enabled on Receive pins Mask */
#define QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_SELECTED_Pos (5)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-up resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-up resistors enabled on Receive pins. Position */
#define QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_SELECTED_Msk (0x1U << QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_SELECTED_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-up resistors on Receive pins while the SPI Chip Select signal is not asserted\n     0=No pull-up resistors enabled on Receive pins. Mask */
#define QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_DRIVEN_Pos (6)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-down resistors on Transmit pins while the pins are not driven\n     0=No pull-down resistors enabled ion Transmit pins. Position */
#define QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_DRIVEN_Msk (0x1U << QMSPI_INTERFACE_CONTROL_PULLDOWN_ON_NOT_DRIVEN_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-down resistors on Transmit pins while the pins are not driven\n     0=No pull-down resistors enabled ion Transmit pins. Mask */
#define QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_DRIVEN_Pos (7)                                            /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-up resistors on Transmit pins while the pins are not driven\n     0=No pull-up resistors enabled ion Transmit pins. Position */
#define QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_DRIVEN_Msk (0x1U << QMSPI_INTERFACE_CONTROL_PULLUP_ON_NOT_DRIVEN_Pos)  /**< (QMSPI_INTERFACE_CONTROL) 1=Enable pull-up resistors on Transmit pins while the pins are not driven\n     0=No pull-up resistors enabled ion Transmit pins. Mask */
#define QMSPI_INTERFACE_CONTROL_Msk           (0x000000FFUL)                                 /**< (QMSPI_INTERFACE_CONTROL) Register Mask  */

/* -------- QMSPI_STATUS : (QMSPI Offset: 0x10) (R/W 32) QMSPI Status Register -------- */

