ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
typedef union
{
  struct
  {
    uint32_t TRANSFER_COMPLETE:1;       /**< bit:      0  In Manual Mode (neither DMA nor Description Buffers are enabled), this bit will be set to 1 when the transfer matches TRANSFER_LENGTH.\n                 If DMA Mode is enabled, this bit will be set to 1 when DMA_COMPLETE is set to 1. In Description Buffer Mode, this bit will be set to 1 only when the Last Buffer completes its transfer.\n     In all cases, this bit will be set to 1 if the STOP bit is set to 1 and the controller has completed the current 8 bits being copied.\n                 1=Transfer completed; 0=Transfer not complete. */
    uint32_t DMA_COMPLETE:1;            /**< bit:      1  This field has no meaning if DMA is not enabled. This bit will be set to 1 when the DMA controller asserts the DONE signal to the SPI controller.\n     This occurs either when the SPI controller has closed the DMA transfer, or the DMA channel has completed its count. If both Transmit and Receive DMA transfers are\n      active, then this bit will only assert after both have completed. If CLOSE_TRANSFER_ENABLE is enabled, DMA_COMPLETE and TRANSFER_COMPLETE will be asserted simultaneously.\n     This status is not inhibited by the description buffers, so it can fire on all valid description buffers while operating in that mode.\n                 1=DMA completed; 0=DMA not completed. */
    uint32_t TRANSMIT_BUFFER_ERROR:1;   /**< bit:      2  1=Overflow error occurred (attempt to write to a full Transmit Buffer)\n                 0=No overflow occurred. */
    uint32_t RECEIVE_BUFFER_ERROR:1;    /**< bit:      3  1=Underflow error occurred (attempt to read from an empty Receive Buffer)\n                 0=No underflow occurred. */
    uint32_t PROGRAMMING_ERROR:1;       /**< bit:      4  This bit if a programming error is detected.\n     1=Programming Error detected; 0=No programming error detected. */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t TRANSMIT_BUFFER_FULL:1;    /**< bit:      8  1=The Transmit Buffer is full\n     0=The Transmit Buffer is not full. */
    uint32_t TRANSMIT_BUFFER_EMPTY:1;   /**< bit:      9  1=The Transmit Buffer is empty\n     0=The Transmit Buffer is not empty. */
    uint32_t TRANSMIT_BUFFER_REQUEST:1;  /**< bit:     10  This status is asserted if the Transmit Buffer reaches a high water mark established by the TRANSMIT_BUFFER_TRIGGER field.\n     1=TRANSMIT_BUFFER_COUNT is less than or equal to TRANSMIT_BUFFER_TRIGGER; 0=TRANSMIT_BUFFER_COUNT is greater than TRANSMIT_BUFFER_TRIGGER. */
    uint32_t TRANSMIT_BUFFER_STALL:1;   /**< bit:     11  1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to read from an empty Transmit Buffer)\n     0=No stalls occurred. */
    uint32_t RECEIVE_BUFFER_FULL:1;     /**< bit:     12  1=The Receive Buffer is full\n     0=The Receive Buffer is not full. */
    uint32_t RECEIVE_BUFFER_EMPTY:1;    /**< bit:     13  1=The Receive Buffer is empty\n     0=The Receive Buffer is not empty. */
    uint32_t RECEIVE_BUFFER_REQUEST:1;  /**< bit:     14  This status is asserted if the Receive Buffer reaches a high water mark established by the RECEIVE_BUFFER_TRIGGER field.\n                 1=RECEIVE_BUFFER_COUNT is greater than or equal to RECEIVE_BUFFER_TRIGGER\n                 0=RECEIVE_BUFFER_COUNT is less than RECEIVE_BUFFER_TRIGGER. */
    uint32_t RECEIVE_BUFFER_STALL:1;    /**< bit:     15  1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to write to a full Receive Buffer)\n     0=No stalls occurred. */
    uint32_t TRANSFER_ACTIVE:1;         /**< bit:     16  1=A transfer is currently executing\n     0=No transfer currently in progress. */
    uint32_t :7;                        /**< bit: 17..23  Reserved                                      */
    uint32_t CURRENT_DESCRIPTION_BUFFER:4;  /**< bit: 24..27  This field shows the Description Buffer currently active. This field has no meaning if Description Buffers are not enabled. */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __QMSPI_STATUS_bits_t;
#define QMSPI_STATUS_RESETVALUE             (0x2000U)                                     /**<  (QMSPI_STATUS) QMSPI Status Register  Reset Value */

#define QMSPI_STATUS_TRANSFER_COMPLETE_Pos    (0)                                            /**< (QMSPI_STATUS) In Manual Mode (neither DMA nor Description Buffers are enabled), this bit will be set to 1 when the transfer matches TRANSFER_LENGTH.\n                 If DMA Mode is enabled, this bit will be set to 1 when DMA_COMPLETE is set to 1. In Description Buffer Mode, this bit will be set to 1 only when the Last Buffer completes its transfer.\n     In all cases, this bit will be set to 1 if the STOP bit is set to 1 and the controller has completed the current 8 bits being copied.\n                 1=Transfer completed; 0=Transfer not complete. Position */
#define QMSPI_STATUS_TRANSFER_COMPLETE_Msk    (0x1U << QMSPI_STATUS_TRANSFER_COMPLETE_Pos)   /**< (QMSPI_STATUS) In Manual Mode (neither DMA nor Description Buffers are enabled), this bit will be set to 1 when the transfer matches TRANSFER_LENGTH.\n                 If DMA Mode is enabled, this bit will be set to 1 when DMA_COMPLETE is set to 1. In Description Buffer Mode, this bit will be set to 1 only when the Last Buffer completes its transfer.\n     In all cases, this bit will be set to 1 if the STOP bit is set to 1 and the controller has completed the current 8 bits being copied.\n                 1=Transfer completed; 0=Transfer not complete. Mask */
#define QMSPI_STATUS_DMA_COMPLETE_Pos         (1)                                            /**< (QMSPI_STATUS) This field has no meaning if DMA is not enabled. This bit will be set to 1 when the DMA controller asserts the DONE signal to the SPI controller.\n     This occurs either when the SPI controller has closed the DMA transfer, or the DMA channel has completed its count. If both Transmit and Receive DMA transfers are\n      active, then this bit will only assert after both have completed. If CLOSE_TRANSFER_ENABLE is enabled, DMA_COMPLETE and TRANSFER_COMPLETE will be asserted simultaneously.\n     This status is not inhibited by the description buffers, so it can fire on all valid description buffers while operating in that mode.\n                 1=DMA completed; 0=DMA not completed. Position */
#define QMSPI_STATUS_DMA_COMPLETE_Msk         (0x1U << QMSPI_STATUS_DMA_COMPLETE_Pos)        /**< (QMSPI_STATUS) This field has no meaning if DMA is not enabled. This bit will be set to 1 when the DMA controller asserts the DONE signal to the SPI controller.\n     This occurs either when the SPI controller has closed the DMA transfer, or the DMA channel has completed its count. If both Transmit and Receive DMA transfers are\n      active, then this bit will only assert after both have completed. If CLOSE_TRANSFER_ENABLE is enabled, DMA_COMPLETE and TRANSFER_COMPLETE will be asserted simultaneously.\n     This status is not inhibited by the description buffers, so it can fire on all valid description buffers while operating in that mode.\n                 1=DMA completed; 0=DMA not completed. Mask */
#define QMSPI_STATUS_TRANSMIT_BUFFER_ERROR_Pos (2)                                            /**< (QMSPI_STATUS) 1=Overflow error occurred (attempt to write to a full Transmit Buffer)\n                 0=No overflow occurred. Position */
#define QMSPI_STATUS_TRANSMIT_BUFFER_ERROR_Msk (0x1U << QMSPI_STATUS_TRANSMIT_BUFFER_ERROR_Pos)  /**< (QMSPI_STATUS) 1=Overflow error occurred (attempt to write to a full Transmit Buffer)\n                 0=No overflow occurred. Mask */
#define QMSPI_STATUS_RECEIVE_BUFFER_ERROR_Pos (3)                                            /**< (QMSPI_STATUS) 1=Underflow error occurred (attempt to read from an empty Receive Buffer)\n                 0=No underflow occurred. Position */
#define QMSPI_STATUS_RECEIVE_BUFFER_ERROR_Msk (0x1U << QMSPI_STATUS_RECEIVE_BUFFER_ERROR_Pos)  /**< (QMSPI_STATUS) 1=Underflow error occurred (attempt to read from an empty Receive Buffer)\n                 0=No underflow occurred. Mask */
#define QMSPI_STATUS_PROGRAMMING_ERROR_Pos    (4)                                            /**< (QMSPI_STATUS) This bit if a programming error is detected.\n     1=Programming Error detected; 0=No programming error detected. Position */
#define QMSPI_STATUS_PROGRAMMING_ERROR_Msk    (0x1U << QMSPI_STATUS_PROGRAMMING_ERROR_Pos)   /**< (QMSPI_STATUS) This bit if a programming error is detected.\n     1=Programming Error detected; 0=No programming error detected. Mask */
#define QMSPI_STATUS_TRANSMIT_BUFFER_FULL_Pos (8)                                            /**< (QMSPI_STATUS) 1=The Transmit Buffer is full\n     0=The Transmit Buffer is not full. Position */
#define QMSPI_STATUS_TRANSMIT_BUFFER_FULL_Msk (0x1U << QMSPI_STATUS_TRANSMIT_BUFFER_FULL_Pos)  /**< (QMSPI_STATUS) 1=The Transmit Buffer is full\n     0=The Transmit Buffer is not full. Mask */
#define QMSPI_STATUS_TRANSMIT_BUFFER_EMPTY_Pos (9)                                            /**< (QMSPI_STATUS) 1=The Transmit Buffer is empty\n     0=The Transmit Buffer is not empty. Position */
#define QMSPI_STATUS_TRANSMIT_BUFFER_EMPTY_Msk (0x1U << QMSPI_STATUS_TRANSMIT_BUFFER_EMPTY_Pos)  /**< (QMSPI_STATUS) 1=The Transmit Buffer is empty\n     0=The Transmit Buffer is not empty. Mask */
#define QMSPI_STATUS_TRANSMIT_BUFFER_REQUEST_Pos (10)                                           /**< (QMSPI_STATUS) This status is asserted if the Transmit Buffer reaches a high water mark established by the TRANSMIT_BUFFER_TRIGGER field.\n     1=TRANSMIT_BUFFER_COUNT is less than or equal to TRANSMIT_BUFFER_TRIGGER; 0=TRANSMIT_BUFFER_COUNT is greater than TRANSMIT_BUFFER_TRIGGER. Position */
#define QMSPI_STATUS_TRANSMIT_BUFFER_REQUEST_Msk (0x1U << QMSPI_STATUS_TRANSMIT_BUFFER_REQUEST_Pos)  /**< (QMSPI_STATUS) This status is asserted if the Transmit Buffer reaches a high water mark established by the TRANSMIT_BUFFER_TRIGGER field.\n     1=TRANSMIT_BUFFER_COUNT is less than or equal to TRANSMIT_BUFFER_TRIGGER; 0=TRANSMIT_BUFFER_COUNT is greater than TRANSMIT_BUFFER_TRIGGER. Mask */
#define QMSPI_STATUS_TRANSMIT_BUFFER_STALL_Pos (11)                                           /**< (QMSPI_STATUS) 1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to read from an empty Transmit Buffer)\n     0=No stalls occurred. Position */
#define QMSPI_STATUS_TRANSMIT_BUFFER_STALL_Msk (0x1U << QMSPI_STATUS_TRANSMIT_BUFFER_STALL_Pos)  /**< (QMSPI_STATUS) 1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to read from an empty Transmit Buffer)\n     0=No stalls occurred. Mask */
#define QMSPI_STATUS_RECEIVE_BUFFER_FULL_Pos  (12)                                           /**< (QMSPI_STATUS) 1=The Receive Buffer is full\n     0=The Receive Buffer is not full. Position */
#define QMSPI_STATUS_RECEIVE_BUFFER_FULL_Msk  (0x1U << QMSPI_STATUS_RECEIVE_BUFFER_FULL_Pos)  /**< (QMSPI_STATUS) 1=The Receive Buffer is full\n     0=The Receive Buffer is not full. Mask */
#define QMSPI_STATUS_RECEIVE_BUFFER_EMPTY_Pos (13)                                           /**< (QMSPI_STATUS) 1=The Receive Buffer is empty\n     0=The Receive Buffer is not empty. Position */
#define QMSPI_STATUS_RECEIVE_BUFFER_EMPTY_Msk (0x1U << QMSPI_STATUS_RECEIVE_BUFFER_EMPTY_Pos)  /**< (QMSPI_STATUS) 1=The Receive Buffer is empty\n     0=The Receive Buffer is not empty. Mask */
#define QMSPI_STATUS_RECEIVE_BUFFER_REQUEST_Pos (14)                                           /**< (QMSPI_STATUS) This status is asserted if the Receive Buffer reaches a high water mark established by the RECEIVE_BUFFER_TRIGGER field.\n                 1=RECEIVE_BUFFER_COUNT is greater than or equal to RECEIVE_BUFFER_TRIGGER\n                 0=RECEIVE_BUFFER_COUNT is less than RECEIVE_BUFFER_TRIGGER. Position */
#define QMSPI_STATUS_RECEIVE_BUFFER_REQUEST_Msk (0x1U << QMSPI_STATUS_RECEIVE_BUFFER_REQUEST_Pos)  /**< (QMSPI_STATUS) This status is asserted if the Receive Buffer reaches a high water mark established by the RECEIVE_BUFFER_TRIGGER field.\n                 1=RECEIVE_BUFFER_COUNT is greater than or equal to RECEIVE_BUFFER_TRIGGER\n                 0=RECEIVE_BUFFER_COUNT is less than RECEIVE_BUFFER_TRIGGER. Mask */
#define QMSPI_STATUS_RECEIVE_BUFFER_STALL_Pos (15)                                           /**< (QMSPI_STATUS) 1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to write to a full Receive Buffer)\n     0=No stalls occurred. Position */
#define QMSPI_STATUS_RECEIVE_BUFFER_STALL_Msk (0x1U << QMSPI_STATUS_RECEIVE_BUFFER_STALL_Pos)  /**< (QMSPI_STATUS) 1=The SPI interface had been stalled due to a flow issue (an attempt by the interface to write to a full Receive Buffer)\n     0=No stalls occurred. Mask */
#define QMSPI_STATUS_TRANSFER_ACTIVE_Pos      (16)                                           /**< (QMSPI_STATUS) 1=A transfer is currently executing\n     0=No transfer currently in progress. Position */
#define QMSPI_STATUS_TRANSFER_ACTIVE_Msk      (0x1U << QMSPI_STATUS_TRANSFER_ACTIVE_Pos)     /**< (QMSPI_STATUS) 1=A transfer is currently executing\n     0=No transfer currently in progress. Mask */
#define QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER_Pos (24)                                           /**< (QMSPI_STATUS) This field shows the Description Buffer currently active. This field has no meaning if Description Buffers are not enabled. Position */
#define QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER_Msk (0xFU << QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER_Pos)  /**< (QMSPI_STATUS) This field shows the Description Buffer currently active. This field has no meaning if Description Buffers are not enabled. Mask */
#define QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER(value) (QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER_Msk & ((value) << QMSPI_STATUS_CURRENT_DESCRIPTION_BUFFER_Pos))
#define QMSPI_STATUS_Msk                      (0x0F01FF1FUL)                                 /**< (QMSPI_STATUS) Register Mask  */

/* -------- QMSPI_BUFFER_COUNT_STATUS : (QMSPI Offset: 0x14) (R/W 32) QMSPI Buffer Count Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_BUFFER_COUNT:16;  /**< bit:  0..15  This is a count of the number of bytes currently valid in the Transmit Buffer. */
    uint32_t RECEIVE_BUFFER_COUNT:16;   /**< bit: 16..31  This is a count of the number of bytes currently valid in the Receive Buffer. */
  };
  uint32_t w;
} __QMSPI_BUFFER_COUNT_STATUS_bits_t;
