ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
#define QMSPI_BUFFER_COUNT_STATUS_RESETVALUE (0x00U)                                       /**<  (QMSPI_BUFFER_COUNT_STATUS) QMSPI Buffer Count Status Register  Reset Value */

#define QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT_Pos (0)                                            /**< (QMSPI_BUFFER_COUNT_STATUS) This is a count of the number of bytes currently valid in the Transmit Buffer. Position */
#define QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT_Msk (0xFFFFU << QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT_Pos)  /**< (QMSPI_BUFFER_COUNT_STATUS) This is a count of the number of bytes currently valid in the Transmit Buffer. Mask */
#define QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT(value) (QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT_Msk & ((value) << QMSPI_BUFFER_COUNT_STATUS_TRANSMIT_BUFFER_COUNT_Pos))
#define QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT_Pos (16)                                           /**< (QMSPI_BUFFER_COUNT_STATUS) This is a count of the number of bytes currently valid in the Receive Buffer. Position */
#define QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT_Msk (0xFFFFU << QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT_Pos)  /**< (QMSPI_BUFFER_COUNT_STATUS) This is a count of the number of bytes currently valid in the Receive Buffer. Mask */
#define QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT(value) (QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT_Msk & ((value) << QMSPI_BUFFER_COUNT_STATUS_RECEIVE_BUFFER_COUNT_Pos))
#define QMSPI_BUFFER_COUNT_STATUS_Msk         (0xFFFFFFFFUL)                                 /**< (QMSPI_BUFFER_COUNT_STATUS) Register Mask  */

/* -------- QMSPI_INTERRUPT_ENABLE : (QMSPI Offset: 0x18) (R/W 32) QMSPI Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSFER_COMPLETE_ENABLE:1;  /**< bit:      0  1=Enable an interrupt if TRANSFER_COMPLETE is asserted\n     0=Disable the interrupt. */
    uint32_t DMA_COMPLETE_ENABLE:1;     /**< bit:      1  1=Enable an interrupt if DMA_COMPLETE is asserted\n     0=Disable the interrupt. */
    uint32_t TRANSMIT_BUFFER_ERROR_ENABLE:1;  /**< bit:      2  1=Enable an interrupt if TRANSMIT_BUFFER_ERROR is asserted\n     0=Disable the interrupt. */
    uint32_t RECEIVE_BUFFER_ERROR_ENABLE:1;  /**< bit:      3  1=Enable an interrupt if RECEIVE_BUFFER_ERROR is asserted\n     0=Disable the interrupt. */
    uint32_t PROGRAMMING_ERROR_ENABLE:1;  /**< bit:      4  1=Enable an interrupt if PROGRAMMING_ERROR is asserted\n     0=Disable the interrupt. */
    uint32_t :3;                        /**< bit:   5..7  Reserved                                      */
    uint32_t TRANSMIT_BUFFER_FULL_ENABLE:1;  /**< bit:      8  1=Enable an interrupt if TRANSMIT_BUFFER_FULL is asserted\n     0=Disable the interrupt. */
    uint32_t TRANSMIT_BUFFER_EMPTY_ENABLE:1;  /**< bit:      9  1=Enable an interrupt if TRANSMIT_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. */
    uint32_t TRANSMIT_BUFFER_REQUEST_ENABLE:1;  /**< bit:     10  1=Enable an interrupt if TRANSMIT_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t RECEIVE_BUFFER_FULL_ENABLE:1;  /**< bit:     12  1=Enable an interrupt if RECEIVE_BUFFER_FULL is asserted\n     0=Disable the interrupt. */
    uint32_t RECEIVE_BUFFER_EMPTY_ENABLE:1;  /**< bit:     13  1=Enable an interrupt if RECEIVE_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. */
    uint32_t RECEIVE_BUFFER_REQUEST_ENABLE:1;  /**< bit:     14  1=Enable an interrupt if RECEIVE_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __QMSPI_INTERRUPT_ENABLE_bits_t;
#define QMSPI_INTERRUPT_ENABLE_RESETVALUE   (0x2000U)                                     /**<  (QMSPI_INTERRUPT_ENABLE) QMSPI Interrupt Enable Register  Reset Value */

#define QMSPI_INTERRUPT_ENABLE_TRANSFER_COMPLETE_ENABLE_Pos (0)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSFER_COMPLETE is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_TRANSFER_COMPLETE_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_TRANSFER_COMPLETE_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSFER_COMPLETE is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_DMA_COMPLETE_ENABLE_Pos (1)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if DMA_COMPLETE is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_DMA_COMPLETE_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_DMA_COMPLETE_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if DMA_COMPLETE is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_ERROR_ENABLE_Pos (2)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_ERROR is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_ERROR_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_ERROR_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_ERROR is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_ERROR_ENABLE_Pos (3)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_ERROR is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_ERROR_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_ERROR_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_ERROR is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_PROGRAMMING_ERROR_ENABLE_Pos (4)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if PROGRAMMING_ERROR is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_PROGRAMMING_ERROR_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_PROGRAMMING_ERROR_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if PROGRAMMING_ERROR is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_FULL_ENABLE_Pos (8)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_FULL is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_FULL_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_FULL_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_FULL is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_EMPTY_ENABLE_Pos (9)                                            /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_EMPTY_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_EMPTY_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_REQUEST_ENABLE_Pos (10)                                           /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_REQUEST_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_TRANSMIT_BUFFER_REQUEST_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if TRANSMIT_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_FULL_ENABLE_Pos (12)                                           /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_FULL is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_FULL_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_FULL_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_FULL is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_EMPTY_ENABLE_Pos (13)                                           /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_EMPTY_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_EMPTY_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_EMPTY is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_REQUEST_ENABLE_Pos (14)                                           /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. Position */
#define QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_REQUEST_ENABLE_Msk (0x1U << QMSPI_INTERRUPT_ENABLE_RECEIVE_BUFFER_REQUEST_ENABLE_Pos)  /**< (QMSPI_INTERRUPT_ENABLE) 1=Enable an interrupt if RECEIVE_BUFFER_REQUEST is asserted\n     0=Disable the interrupt. Mask */
#define QMSPI_INTERRUPT_ENABLE_Msk            (0x0000771FUL)                                 /**< (QMSPI_INTERRUPT_ENABLE) Register Mask  */

