ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
/* -------- QMSPI_BUFFER_COUNT_TRIGGER : (QMSPI Offset: 0x1c) (R/W 32) QMSPI Buffer Count Trigger Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_BUFFER_TRIGGER:16;  /**< bit:  0..15  An interrupt is triggered if the TRANSMIT_BUFFER_COUNT field is less than or equal to this value. A value of 0 disables the interrupt. */
    uint32_t RECEIVE_BUFFER_TRIGGER:16;  /**< bit: 16..31  An interrupt is triggered if the RECEIVE_BUFFER_COUNT field is greater than or equal to this value. A value of 0 disables the interrupt. */
  };
  uint32_t w;
} __QMSPI_BUFFER_COUNT_TRIGGER_bits_t;
#define QMSPI_BUFFER_COUNT_TRIGGER_RESETVALUE (0x00U)                                       /**<  (QMSPI_BUFFER_COUNT_TRIGGER) QMSPI Buffer Count Trigger Register  Reset Value */

#define QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER_Pos (0)                                            /**< (QMSPI_BUFFER_COUNT_TRIGGER) An interrupt is triggered if the TRANSMIT_BUFFER_COUNT field is less than or equal to this value. A value of 0 disables the interrupt. Position */
#define QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER_Msk (0xFFFFU << QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER_Pos)  /**< (QMSPI_BUFFER_COUNT_TRIGGER) An interrupt is triggered if the TRANSMIT_BUFFER_COUNT field is less than or equal to this value. A value of 0 disables the interrupt. Mask */
#define QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER(value) (QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER_Msk & ((value) << QMSPI_BUFFER_COUNT_TRIGGER_TRANSMIT_BUFFER_TRIGGER_Pos))
#define QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER_Pos (16)                                           /**< (QMSPI_BUFFER_COUNT_TRIGGER) An interrupt is triggered if the RECEIVE_BUFFER_COUNT field is greater than or equal to this value. A value of 0 disables the interrupt. Position */
#define QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER_Msk (0xFFFFU << QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER_Pos)  /**< (QMSPI_BUFFER_COUNT_TRIGGER) An interrupt is triggered if the RECEIVE_BUFFER_COUNT field is greater than or equal to this value. A value of 0 disables the interrupt. Mask */
#define QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER(value) (QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER_Msk & ((value) << QMSPI_BUFFER_COUNT_TRIGGER_RECEIVE_BUFFER_TRIGGER_Pos))
#define QMSPI_BUFFER_COUNT_TRIGGER_Msk        (0xFFFFFFFFUL)                                 /**< (QMSPI_BUFFER_COUNT_TRIGGER) Register Mask  */

/* -------- QMSPI_TRAMSMIT_BUFFER : (QMSPI Offset: 0x20) (R/W 32) QMSPI Transmit Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t TRANSMIT_BUFFER:32;        /**< bit:  0..31  Writes to this register store data to be transmitted from the SPI Master to the external SPI Slave.\n     Writes to this block will be written to the Transmit FIFO. A 1 Byte write fills 1 byte of the FIFO. A Word write fills 2 Bytes and a Doubleword write fills 4 bytes.\n     The data must always be aligned to the bottom most byte (so 1 byte write is on bits [7:0] and Word write is on [15:0]).\n     An overflow condition, TRANSMIT_BUFFER_ERROR, if a write to a full FIFO occurs. Write accesses to this register increment the TRANSMIT_BUFFER_COUNT field. */
  };
  uint32_t w;
} __QMSPI_TRAMSMIT_BUFFER_bits_t;
#define QMSPI_TRAMSMIT_BUFFER_RESETVALUE    (0x00U)                                       /**<  (QMSPI_TRAMSMIT_BUFFER) QMSPI Transmit Buffer Register  Reset Value */

#define QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER_Pos (0)                                            /**< (QMSPI_TRAMSMIT_BUFFER) Writes to this register store data to be transmitted from the SPI Master to the external SPI Slave.\n     Writes to this block will be written to the Transmit FIFO. A 1 Byte write fills 1 byte of the FIFO. A Word write fills 2 Bytes and a Doubleword write fills 4 bytes.\n     The data must always be aligned to the bottom most byte (so 1 byte write is on bits [7:0] and Word write is on [15:0]).\n     An overflow condition, TRANSMIT_BUFFER_ERROR, if a write to a full FIFO occurs. Write accesses to this register increment the TRANSMIT_BUFFER_COUNT field. Position */
#define QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER_Msk (0xFFFFFFFFU << QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER_Pos)  /**< (QMSPI_TRAMSMIT_BUFFER) Writes to this register store data to be transmitted from the SPI Master to the external SPI Slave.\n     Writes to this block will be written to the Transmit FIFO. A 1 Byte write fills 1 byte of the FIFO. A Word write fills 2 Bytes and a Doubleword write fills 4 bytes.\n     The data must always be aligned to the bottom most byte (so 1 byte write is on bits [7:0] and Word write is on [15:0]).\n     An overflow condition, TRANSMIT_BUFFER_ERROR, if a write to a full FIFO occurs. Write accesses to this register increment the TRANSMIT_BUFFER_COUNT field. Mask */
#define QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER(value) (QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER_Msk & ((value) << QMSPI_TRAMSMIT_BUFFER_TRANSMIT_BUFFER_Pos))
#define QMSPI_TRAMSMIT_BUFFER_Msk             (0xFFFFFFFFUL)                                 /**< (QMSPI_TRAMSMIT_BUFFER) Register Mask  */

/* -------- QMSPI_RECEIVE_BUFFER : (QMSPI Offset: 0x24) (R/W 32) QMSPI Receive Buffer Register -------- */

typedef union
{
  struct
  {
    uint32_t RECEIVE_BUFFER:32;         /**< bit:  0..31  Buffer that stores data from the external SPI Slave device to the SPI Master (this block), which is received over MISO or IO.\n     Reads from this register will empty the Rx FIFO. A 1 Byte read will have valid data on bits [7:0] and a Word read will have data on bits [15:0].\n     It is possible to request more data than the FIFO has (underflow condition), but this will cause an error (Rx Buffer Error).\n     Read accesses to this register decrement the RECEIVE_BUFFER_COUNT field. */
  };
  uint32_t w;
} __QMSPI_RECEIVE_BUFFER_bits_t;
#define QMSPI_RECEIVE_BUFFER_RESETVALUE     (0x00U)                                       /**<  (QMSPI_RECEIVE_BUFFER) QMSPI Receive Buffer Register  Reset Value */

#define QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER_Pos (0)                                            /**< (QMSPI_RECEIVE_BUFFER) Buffer that stores data from the external SPI Slave device to the SPI Master (this block), which is received over MISO or IO.\n     Reads from this register will empty the Rx FIFO. A 1 Byte read will have valid data on bits [7:0] and a Word read will have data on bits [15:0].\n     It is possible to request more data than the FIFO has (underflow condition), but this will cause an error (Rx Buffer Error).\n     Read accesses to this register decrement the RECEIVE_BUFFER_COUNT field. Position */
#define QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER_Msk (0xFFFFFFFFU << QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER_Pos)  /**< (QMSPI_RECEIVE_BUFFER) Buffer that stores data from the external SPI Slave device to the SPI Master (this block), which is received over MISO or IO.\n     Reads from this register will empty the Rx FIFO. A 1 Byte read will have valid data on bits [7:0] and a Word read will have data on bits [15:0].\n     It is possible to request more data than the FIFO has (underflow condition), but this will cause an error (Rx Buffer Error).\n     Read accesses to this register decrement the RECEIVE_BUFFER_COUNT field. Mask */
#define QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER(value) (QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER_Msk & ((value) << QMSPI_RECEIVE_BUFFER_RECEIVE_BUFFER_Pos))
#define QMSPI_RECEIVE_BUFFER_Msk              (0xFFFFFFFFUL)                                 /**< (QMSPI_RECEIVE_BUFFER) Register Mask  */

/* -------- QMSPI_CS_TIMING_REG : (QMSPI Offset: 0x28) (R/W 32) QMSPI Chip Select Timing Register -------- */

typedef union
{
  struct
  {
    uint32_t DLY_CS_ON_TO_CLOCK_START:4;  /**< bit:   0..3                                                */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t DLY_CLK_STOP_TO_CS_OFF:4;  /**< bit:  8..11  This selects the number of system clock cycles between the last clock edge and the deassertion of CS.\n */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t DLY_LAST_DATA_HOLD:4;      /**< bit: 16..19  This selects the number of system clock cycles between CS deassertion to the data ports for WP and HOLD \n    switching from input to output. This is only used if the WP/HOLD functions are in use and only on IO2/WP \n           and IO3/HOLD pins. */
    uint32_t :3;                        /**< bit: 20..22  Reserved                                      */
    uint32_t DLY_CS_OFF_TO_CS_ON:9;     /**< bit: 23..31  This selects the number of system clock cycles between CS deassertion to CS assertion. This is the minimum \n           pulse width of CS deassertion. */
  };
  uint32_t w;
} __QMSPI_CS_TIMING_REG_bits_t;
#define QMSPI_CS_TIMING_REG_RESETVALUE      (0x6060406U)                                  /**<  (QMSPI_CS_TIMING_REG) QMSPI Chip Select Timing Register  Reset Value */

#define QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START_Pos (0)                                            /**< (QMSPI_CS_TIMING_REG)  Position */
#define QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START_Msk (0xFU << QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START_Pos)  /**< (QMSPI_CS_TIMING_REG)  Mask */
#define QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START(value) (QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START_Msk & ((value) << QMSPI_CS_TIMING_REG_DLY_CS_ON_TO_CLOCK_START_Pos))
#define QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF_Pos (8)                                            /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between the last clock edge and the deassertion of CS.\n Position */
#define QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF_Msk (0xFU << QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF_Pos)  /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between the last clock edge and the deassertion of CS.\n Mask */
#define QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF(value) (QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF_Msk & ((value) << QMSPI_CS_TIMING_REG_DLY_CLK_STOP_TO_CS_OFF_Pos))
#define QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD_Pos (16)                                           /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between CS deassertion to the data ports for WP and HOLD \n    switching from input to output. This is only used if the WP/HOLD functions are in use and only on IO2/WP \n           and IO3/HOLD pins. Position */
#define QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD_Msk (0xFU << QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD_Pos)  /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between CS deassertion to the data ports for WP and HOLD \n    switching from input to output. This is only used if the WP/HOLD functions are in use and only on IO2/WP \n           and IO3/HOLD pins. Mask */
#define QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD(value) (QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD_Msk & ((value) << QMSPI_CS_TIMING_REG_DLY_LAST_DATA_HOLD_Pos))
#define QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON_Pos (23)                                           /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between CS deassertion to CS assertion. This is the minimum \n           pulse width of CS deassertion. Position */
#define QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON_Msk (0x1FFU << QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON_Pos)  /**< (QMSPI_CS_TIMING_REG) This selects the number of system clock cycles between CS deassertion to CS assertion. This is the minimum \n           pulse width of CS deassertion. Mask */
#define QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON(value) (QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON_Msk & ((value) << QMSPI_CS_TIMING_REG_DLY_CS_OFF_TO_CS_ON_Pos))
#define QMSPI_CS_TIMING_REG_Msk               (0xFF8F0F0FUL)                                 /**< (QMSPI_CS_TIMING_REG) Register Mask  */

/* -------- QMSPI_DESCRIPTION_BUFFER_0 : (QMSPI Offset: 0x30) (R/W 32) QMSPI Description Buffer 0 Register -------- */

typedef union
{
  struct
  {
    uint32_t INTERFACE_MODE:2;          /**< bit:   0..1  This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n     3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. */
    uint32_t TX_TRANSFER_ENABLE:2;      /**< bit:   2..3  This field bit selects the transmit function of the SPI interface.\n     3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used\n     2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n     1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n     0=Transmit is Disabled. No data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. */
    uint32_t TX_DMA_ENABLE:2;           /**< bit:   4..5  This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either the interface\n     reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n      2=DMA is enabled and set to 2 Bytes\n      3=DMA is enabled and set to 4 Bytes     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware. */
    uint32_t RX_TRANSFER_ENABLE:1;      /**< bit:      6  This bit enables the receive function of the SPI interface.\n     1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer; 0=Receive is disabled. */
    uint32_t RX_DMA_ENABLE:2;           /**< bit:   7..8  This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface reaches TRANSFER_LENGTH or the DMA sends a termination request.\n The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n     2=DMA is enabled and set to 2 Bytes\n     3=DMA is enabled and set to 4 Bytes\n     0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware. */
    uint32_t CLOSE_TRANFSER_ENABLE:1;   /**< bit:      9  This selects what action is taken at the end of a transfer. This bit must be set only on the Last Buffer.\n     1=The transfer is terminated. The Chip Select de-asserts, the SPI interface returns to IDLE and the DMA interface completes the transfer.\n     0=The transfer is not closed. Chip Select remains asserted and the DMA interface and the SPI interface remain active */
    uint32_t TRANSFER_LENGTH_BITS:1;    /**< bit:     10  1=TRANSFER_LENGTH defined in bits\n      0=TRANSFER_LENGTH defined in bytes */
    uint32_t DESCRIPTION_BUFFER_LAST:1;  /**< bit:     11  If this bit is 1 then this is the last Description Buffer in the chain. When the transfer described by this buffer completes the TRANSFER_COMPLETE status will be set to 1.\n     If this bit is 0, then this is not the last buffer in use. When the transfer completes the next buffer will be activated, and no additional status will be asserted. */
    uint32_t DESCRIPTION_BUFFER_NEXT_POINTER:4;  /**< bit: 12..15  This defines the next buffer to be used if Description Buffers are enabled and this is not the last buffer. This can point to the current buffer, creating an infinite loop. */
    uint32_t TRANSFER_LENGTH:16;        /**< bit: 16..31  The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS. A value of 0 means an infinite length transfer. */
  };
  uint32_t w;
} __QMSPI_DESCRIPTION_BUFFER_0_bits_t;
#define QMSPI_DESCRIPTION_BUFFER_0_RESETVALUE (0x200U)                                      /**<  (QMSPI_DESCRIPTION_BUFFER_0) QMSPI Description Buffer 0 Register  Reset Value */

