ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
#define QMSPI_DESCRIPTION_BUFFER_6_RESETVALUE (0x200U)                                      /**<  (QMSPI_DESCRIPTION_BUFFER_6) QMSPI Description Buffer 6 Register  Reset Value */

#define QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE_Pos (0)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n     3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE_Msk (0x3U << QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n     3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE(value) (QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_INTERFACE_MODE_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE_Pos (2)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This field bit selects the transmit function of the SPI interface.\n     3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used\n     2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n     1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n     0=Transmit is Disabled. No data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE_Msk (0x3U << QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This field bit selects the transmit function of the SPI interface.\n     3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used\n     2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n     1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n     0=Transmit is Disabled. No data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE(value) (QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_TX_TRANSFER_ENABLE_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE_Pos (4)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either the interface\n     reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n      2=DMA is enabled and set to 2 Bytes\n      3=DMA is enabled and set to 4 Bytes     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE_Msk (0x3U << QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either the interface\n     reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n      2=DMA is enabled and set to 2 Bytes\n      3=DMA is enabled and set to 4 Bytes     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE(value) (QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_TX_DMA_ENABLE_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_RX_TRANSFER_ENABLE_Pos (6)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables the receive function of the SPI interface.\n     1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer; 0=Receive is disabled. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_RX_TRANSFER_ENABLE_Msk (0x1U << QMSPI_DESCRIPTION_BUFFER_6_RX_TRANSFER_ENABLE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables the receive function of the SPI interface.\n     1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer; 0=Receive is disabled. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE_Pos (7)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface reaches TRANSFER_LENGTH or the DMA sends a termination request.\n The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n     2=DMA is enabled and set to 2 Bytes\n     3=DMA is enabled and set to 4 Bytes\n     0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE_Msk (0x3U << QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface reaches TRANSFER_LENGTH or the DMA sends a termination request.\n The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n     2=DMA is enabled and set to 2 Bytes\n     3=DMA is enabled and set to 4 Bytes\n     0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE(value) (QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_RX_DMA_ENABLE_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_CLOSE_TRANFSER_ENABLE_Pos (9)                                            /**< (QMSPI_DESCRIPTION_BUFFER_6) This selects what action is taken at the end of a transfer. This bit must be set only on the Last Buffer.\n     1=The transfer is terminated. The Chip Select de-asserts, the SPI interface returns to IDLE and the DMA interface completes the transfer.\n     0=The transfer is not closed. Chip Select remains asserted and the DMA interface and the SPI interface remain active Position */
#define QMSPI_DESCRIPTION_BUFFER_6_CLOSE_TRANFSER_ENABLE_Msk (0x1U << QMSPI_DESCRIPTION_BUFFER_6_CLOSE_TRANFSER_ENABLE_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This selects what action is taken at the end of a transfer. This bit must be set only on the Last Buffer.\n     1=The transfer is terminated. The Chip Select de-asserts, the SPI interface returns to IDLE and the DMA interface completes the transfer.\n     0=The transfer is not closed. Chip Select remains asserted and the DMA interface and the SPI interface remain active Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_BITS_Pos (10)                                           /**< (QMSPI_DESCRIPTION_BUFFER_6) 1=TRANSFER_LENGTH defined in bits\n      0=TRANSFER_LENGTH defined in bytes Position */
#define QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_BITS_Msk (0x1U << QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_BITS_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) 1=TRANSFER_LENGTH defined in bits\n      0=TRANSFER_LENGTH defined in bytes Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_LAST_Pos (11)                                           /**< (QMSPI_DESCRIPTION_BUFFER_6) If this bit is 1 then this is the last Description Buffer in the chain. When the transfer described by this buffer completes the TRANSFER_COMPLETE status will be set to 1.\n     If this bit is 0, then this is not the last buffer in use. When the transfer completes the next buffer will be activated, and no additional status will be asserted. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_LAST_Msk (0x1U << QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_LAST_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) If this bit is 1 then this is the last Description Buffer in the chain. When the transfer described by this buffer completes the TRANSFER_COMPLETE status will be set to 1.\n     If this bit is 0, then this is not the last buffer in use. When the transfer completes the next buffer will be activated, and no additional status will be asserted. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER_Pos (12)                                           /**< (QMSPI_DESCRIPTION_BUFFER_6) This defines the next buffer to be used if Description Buffers are enabled and this is not the last buffer. This can point to the current buffer, creating an infinite loop. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER_Msk (0xFU << QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) This defines the next buffer to be used if Description Buffers are enabled and this is not the last buffer. This can point to the current buffer, creating an infinite loop. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER(value) (QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_DESCRIPTION_BUFFER_NEXT_POINTER_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_Pos (16)                                           /**< (QMSPI_DESCRIPTION_BUFFER_6) The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS. A value of 0 means an infinite length transfer. Position */
#define QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_Msk (0xFFFFU << QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_Pos)  /**< (QMSPI_DESCRIPTION_BUFFER_6) The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS. A value of 0 means an infinite length transfer. Mask */
#define QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH(value) (QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_Msk & ((value) << QMSPI_DESCRIPTION_BUFFER_6_TRANSFER_LENGTH_Pos))
#define QMSPI_DESCRIPTION_BUFFER_6_Msk        (0xFFFFFFFFUL)                                 /**< (QMSPI_DESCRIPTION_BUFFER_6) Register Mask  */

/* -------- QMSPI_DESCRIPTION_BUFFER_7 : (QMSPI Offset: 0x4c) (R/W 32) QMSPI Description Buffer 7 Register -------- */

typedef union
{
  struct
  {
    uint32_t INTERFACE_MODE:2;          /**< bit:   0..1  This field sets the transmission mode. If this field is set for Dual Mode or Quad Mode then either TX_TRANSFER_ENABLE or RX_TRANSFER_ENABLE must be 0.\n     3=Reserved; 2=Quad Mode; 1=Dual Mode; 0=Single/Duplex Mode. */
    uint32_t TX_TRANSFER_ENABLE:2;      /**< bit:   2..3  This field bit selects the transmit function of the SPI interface.\n     3=Transmit Enabled in 1 Mode. The MOSI or IO Bus will send out only 1's. The Transmit Buffer will not be used\n     2=Transmit Enabled in 0 Mode. The MOSI or IO Bus will send out only 0's. The Transmit Buffer will not be used.\n     1=Transmit Enabled. Data will be fetched from the Transmit Buffer and sent out on the MOSI or IO Bus.\n     0=Transmit is Disabled. No data is sent. This will cause the MOSI be to be undriven, or the IO bus to be undriven if Receive is also disabled. */
    uint32_t TX_DMA_ENABLE:2;           /**< bit:   4..5  This bit enables DMA support for Transmit Transfer. If enabled, DMA will be requested to fill the FIFO until either the interface\n     reaches TRANSFER_LENGTH or the DMA sends a termination request. The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n      2=DMA is enabled and set to 2 Bytes\n      3=DMA is enabled and set to 4 Bytes     0=DMA is disabled. All data in the Transmit Buffer must be emptied by firmware. */
    uint32_t RX_TRANSFER_ENABLE:1;      /**< bit:      6  This bit enables the receive function of the SPI interface.\n     1=Receive is enabled. Data received from the SPI Slave is stored in the Receive Buffer; 0=Receive is disabled. */
    uint32_t RX_DMA_ENABLE:2;           /**< bit:   7..8  This bit enables DMA support for Receive Transfer. If enabled, DMA will be requested to empty the FIFO until either the interface reaches TRANSFER_LENGTH or the DMA sends a termination request.\n The size defined here must match DMA programmed access size.\n     1=DMA is enabled.and set to 1 Byte\n     2=DMA is enabled and set to 2 Bytes\n     3=DMA is enabled and set to 4 Bytes\n     0=DMA is disabled. All data in the Receive Buffer must be emptied by firmware. */
    uint32_t CLOSE_TRANFSER_ENABLE:1;   /**< bit:      9  This selects what action is taken at the end of a transfer. This bit must be set only on the Last Buffer.\n     1=The transfer is terminated. The Chip Select de-asserts, the SPI interface returns to IDLE and the DMA interface completes the transfer.\n     0=The transfer is not closed. Chip Select remains asserted and the DMA interface and the SPI interface remain active */
    uint32_t TRANSFER_LENGTH_BITS:1;    /**< bit:     10  1=TRANSFER_LENGTH defined in bits\n      0=TRANSFER_LENGTH defined in bytes */
    uint32_t DESCRIPTION_BUFFER_LAST:1;  /**< bit:     11  If this bit is 1 then this is the last Description Buffer in the chain. When the transfer described by this buffer completes the TRANSFER_COMPLETE status will be set to 1.\n     If this bit is 0, then this is not the last buffer in use. When the transfer completes the next buffer will be activated, and no additional status will be asserted. */
    uint32_t DESCRIPTION_BUFFER_NEXT_POINTER:4;  /**< bit: 12..15  This defines the next buffer to be used if Description Buffers are enabled and this is not the last buffer. This can point to the current buffer, creating an infinite loop. */
    uint32_t TRANSFER_LENGTH:16;        /**< bit: 16..31  The length of the SPI transfer. The count is in bytes or bits, depending on the value of TRANSFER_LENGTH_BITS. A value of 0 means an infinite length transfer. */
  };
  uint32_t w;
} __QMSPI_DESCRIPTION_BUFFER_7_bits_t;
