ranjithaguna/pv/LED_Demo/source/pic32cx/component/qmspi.h
/** \brief QMSPI register offsets definitions */
#define QMSPI_MODE_OFFSET            (0x00)         /**< (QMSPI_MODE) QMSPI Mode Register Offset */
#define QMSPI_CONTROL_OFFSET         (0x04)         /**< (QMSPI_CONTROL) QMSPI SPI Control Offset */
#define QMSPI_EXECUTE_OFFSET         (0x08)         /**< (QMSPI_EXECUTE) QMSPI Execute Register Offset */
#define QMSPI_INTERFACE_CONTROL_OFFSET (0x0C)         /**< (QMSPI_INTERFACE_CONTROL) QMSPI Interface Control Register Offset */
#define QMSPI_STATUS_OFFSET          (0x10)         /**< (QMSPI_STATUS) QMSPI Status Register Offset */
#define QMSPI_BUFFER_COUNT_STATUS_OFFSET (0x14)         /**< (QMSPI_BUFFER_COUNT_STATUS) QMSPI Buffer Count Status Register Offset */
#define QMSPI_INTERRUPT_ENABLE_OFFSET (0x18)         /**< (QMSPI_INTERRUPT_ENABLE) QMSPI Interrupt Enable Register Offset */
#define QMSPI_BUFFER_COUNT_TRIGGER_OFFSET (0x1C)         /**< (QMSPI_BUFFER_COUNT_TRIGGER) QMSPI Buffer Count Trigger Register Offset */
#define QMSPI_TRAMSMIT_BUFFER_OFFSET (0x20)         /**< (QMSPI_TRAMSMIT_BUFFER) QMSPI Transmit Buffer Register Offset */
#define QMSPI_RECEIVE_BUFFER_OFFSET  (0x24)         /**< (QMSPI_RECEIVE_BUFFER) QMSPI Receive Buffer Register Offset */
#define QMSPI_CS_TIMING_REG_OFFSET   (0x28)         /**< (QMSPI_CS_TIMING_REG) QMSPI Chip Select Timing Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_0_OFFSET (0x30)         /**< (QMSPI_DESCRIPTION_BUFFER_0) QMSPI Description Buffer 0 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_1_OFFSET (0x34)         /**< (QMSPI_DESCRIPTION_BUFFER_1) QMSPI Description Buffer 1 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_2_OFFSET (0x38)         /**< (QMSPI_DESCRIPTION_BUFFER_2) QMSPI Description Buffer 2 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_3_OFFSET (0x3C)         /**< (QMSPI_DESCRIPTION_BUFFER_3) QMSPI Description Buffer 3 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_4_OFFSET (0x40)         /**< (QMSPI_DESCRIPTION_BUFFER_4) QMSPI Description Buffer 4 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_5_OFFSET (0x44)         /**< (QMSPI_DESCRIPTION_BUFFER_5) QMSPI Description Buffer 5 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_6_OFFSET (0x48)         /**< (QMSPI_DESCRIPTION_BUFFER_6) QMSPI Description Buffer 6 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_7_OFFSET (0x4C)         /**< (QMSPI_DESCRIPTION_BUFFER_7) QMSPI Description Buffer 7 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_8_OFFSET (0x50)         /**< (QMSPI_DESCRIPTION_BUFFER_8) QMSPI Description Buffer 8 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_9_OFFSET (0x54)         /**< (QMSPI_DESCRIPTION_BUFFER_9) QMSPI Description Buffer 9 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_10_OFFSET (0x58)         /**< (QMSPI_DESCRIPTION_BUFFER_10) QMSPI Description Buffer 10 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_11_OFFSET (0x5C)         /**< (QMSPI_DESCRIPTION_BUFFER_11) QMSPI Description Buffer 11 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_12_OFFSET (0x60)         /**< (QMSPI_DESCRIPTION_BUFFER_12) QMSPI Description Buffer 12 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_13_OFFSET (0x64)         /**< (QMSPI_DESCRIPTION_BUFFER_13) QMSPI Description Buffer 13 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_14_OFFSET (0x68)         /**< (QMSPI_DESCRIPTION_BUFFER_14) QMSPI Description Buffer 14 Register Offset */
#define QMSPI_DESCRIPTION_BUFFER_15_OFFSET (0x6C)         /**< (QMSPI_DESCRIPTION_BUFFER_15) QMSPI Description Buffer 15 Register Offset */

/** \brief QMSPI register API structure */
typedef struct
{  /* The Quad SPI Master Controller may be used to communicate with various \n        peripheral devices that use a Serial Peripheral Interface, such as EEPROMS, DACs and ADCs.\n        The controller can be configured to support advanced SPI Flash devices with multi-phase access protocols. */
  __IO  __QMSPI_MODE_bits_t            QMSPI_MODE;    /**< Offset: 0x00 (R/W  32) QMSPI Mode Register */
  __IO  __QMSPI_CONTROL_bits_t         QMSPI_CONTROL; /**< Offset: 0x04 (R/W  32) QMSPI SPI Control */
  __IO  __QMSPI_EXECUTE_bits_t         QMSPI_EXECUTE; /**< Offset: 0x08 (R/W  32) QMSPI Execute Register */
  __IO  __QMSPI_INTERFACE_CONTROL_bits_t QMSPI_INTERFACE_CONTROL; /**< Offset: 0x0C (R/W  32) QMSPI Interface Control Register */
  __IO  __QMSPI_STATUS_bits_t          QMSPI_STATUS;  /**< Offset: 0x10 (R/W  32) QMSPI Status Register */
  __IO  __QMSPI_BUFFER_COUNT_STATUS_bits_t QMSPI_BUFFER_COUNT_STATUS; /**< Offset: 0x14 (R/W  32) QMSPI Buffer Count Status Register */
  __IO  __QMSPI_INTERRUPT_ENABLE_bits_t QMSPI_INTERRUPT_ENABLE; /**< Offset: 0x18 (R/W  32) QMSPI Interrupt Enable Register */
  __IO  __QMSPI_BUFFER_COUNT_TRIGGER_bits_t QMSPI_BUFFER_COUNT_TRIGGER; /**< Offset: 0x1C (R/W  32) QMSPI Buffer Count Trigger Register */
  __IO  __QMSPI_TRAMSMIT_BUFFER_bits_t QMSPI_TRAMSMIT_BUFFER; /**< Offset: 0x20 (R/W  32) QMSPI Transmit Buffer Register */
  __IO  __QMSPI_RECEIVE_BUFFER_bits_t  QMSPI_RECEIVE_BUFFER; /**< Offset: 0x24 (R/W  32) QMSPI Receive Buffer Register */
  __IO  __QMSPI_CS_TIMING_REG_bits_t   QMSPI_CS_TIMING_REG; /**< Offset: 0x28 (R/W  32) QMSPI Chip Select Timing Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_0_bits_t QMSPI_DESCRIPTION_BUFFER_0; /**< Offset: 0x30 (R/W  32) QMSPI Description Buffer 0 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_1_bits_t QMSPI_DESCRIPTION_BUFFER_1; /**< Offset: 0x34 (R/W  32) QMSPI Description Buffer 1 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_2_bits_t QMSPI_DESCRIPTION_BUFFER_2; /**< Offset: 0x38 (R/W  32) QMSPI Description Buffer 2 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_3_bits_t QMSPI_DESCRIPTION_BUFFER_3; /**< Offset: 0x3C (R/W  32) QMSPI Description Buffer 3 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_4_bits_t QMSPI_DESCRIPTION_BUFFER_4; /**< Offset: 0x40 (R/W  32) QMSPI Description Buffer 4 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_5_bits_t QMSPI_DESCRIPTION_BUFFER_5; /**< Offset: 0x44 (R/W  32) QMSPI Description Buffer 5 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_6_bits_t QMSPI_DESCRIPTION_BUFFER_6; /**< Offset: 0x48 (R/W  32) QMSPI Description Buffer 6 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_7_bits_t QMSPI_DESCRIPTION_BUFFER_7; /**< Offset: 0x4C (R/W  32) QMSPI Description Buffer 7 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_8_bits_t QMSPI_DESCRIPTION_BUFFER_8; /**< Offset: 0x50 (R/W  32) QMSPI Description Buffer 8 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_9_bits_t QMSPI_DESCRIPTION_BUFFER_9; /**< Offset: 0x54 (R/W  32) QMSPI Description Buffer 9 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_10_bits_t QMSPI_DESCRIPTION_BUFFER_10; /**< Offset: 0x58 (R/W  32) QMSPI Description Buffer 10 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_11_bits_t QMSPI_DESCRIPTION_BUFFER_11; /**< Offset: 0x5C (R/W  32) QMSPI Description Buffer 11 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_12_bits_t QMSPI_DESCRIPTION_BUFFER_12; /**< Offset: 0x60 (R/W  32) QMSPI Description Buffer 12 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_13_bits_t QMSPI_DESCRIPTION_BUFFER_13; /**< Offset: 0x64 (R/W  32) QMSPI Description Buffer 13 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_14_bits_t QMSPI_DESCRIPTION_BUFFER_14; /**< Offset: 0x68 (R/W  32) QMSPI Description Buffer 14 Register */
  __IO  __QMSPI_DESCRIPTION_BUFFER_15_bits_t QMSPI_DESCRIPTION_BUFFER_15; /**< Offset: 0x6C (R/W  32) QMSPI Description Buffer 15 Register */
} qmspi_registers_t;
/** @}  end of The Quad SPI Master Controller may be used to communicate with various \n        peripheral devices that use a Serial Peripheral Interface, such as EEPROMS, DACs and ADCs.\n        The controller can be configured to support advanced SPI Flash devices with multi-phase access protocols. */

#endif /* _PIC32CX_0525SG12_QMSPI_COMPONENT_H_ */
